<a href="https://colab.research.google.com/github/a-dhingra/pandas_exercises/blob/master/05_Merge/Fictitous%20Names/Exercises_SolvedBySelf.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Fictitious Names

### Introduction:

This time you will create a data again 

Special thanks to [Chris Albon](http://chrisalbon.com/) for sharing the dataset and materials.
All the credits to this exercise belongs to him.  

In order to understand about it go [here](https://blog.codinghorror.com/a-visual-explanation-of-sql-joins/).

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create the 3 DataFrames based on the following raw data

In [3]:
raw_data_1 = {
        'subject_id': ['1', '2', '3', '4', '5'],
        'first_name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'], 
        'last_name': ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']}

raw_data_2 = {
        'subject_id': ['4', '5', '6', '7', '8'],
        'first_name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'], 
        'last_name': ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan']}

raw_data_3 = {
        'subject_id': ['1', '2', '3', '4', '5', '7', '8', '9', '10', '11'],
        'test_id': [51, 15, 15, 61, 16, 14, 15, 1, 61, 16]}

In [5]:
df_1 = pd.DataFrame(raw_data_1, columns=list(raw_data_1.keys()))
df_2 = pd.DataFrame(raw_data_2, columns=list(raw_data_2.keys()))
df_3 = pd.DataFrame(raw_data_3, columns=list(raw_data_3.keys()))
df_1.head()

  subject_id last_name first_name
0          1  Anderson       Alex
1          2  Ackerman        Amy
2          3       Ali      Allen
3          4      Aoni      Alice
4          5   Atiches     Ayoung

In [13]:
df_1.index

RangeIndex(start=0, stop=5, step=1)

In [14]:
df_2.index

RangeIndex(start=0, stop=5, step=1)

In [10]:
df_3.size

20

### Step 3. Assign each to a variable called data1, data2, data3

In [11]:
data1 = df_1.copy()
data2 = df_2.copy()
data3 = df_3.copy()

### Step 4. Join the two dataframes along rows and assign all_data

In [17]:
all_data = pd.concat([data1,data2],ignore_index=True)
all_data.head(10)

  subject_id last_name first_name
0          1  Anderson       Alex
1          2  Ackerman        Amy
2          3       Ali      Allen
3          4      Aoni      Alice
4          5   Atiches     Ayoung
5          4    Bonder      Billy
6          5     Black      Brian
7          6   Balwner       Bran
8          7     Brice      Bryce
9          8    Btisan      Betty

### Step 5. Join the two dataframes along columns and assing to all_data_col

In [19]:
all_data_col = pd.concat([data1,data2],axis=1)
all_data_col.head()

  subject_id last_name first_name subject_id last_name first_name
0          1  Anderson       Alex          4    Bonder      Billy
1          2  Ackerman        Amy          5     Black      Brian
2          3       Ali      Allen          6   Balwner       Bran
3          4      Aoni      Alice          7     Brice      Bryce
4          5   Atiches     Ayoung          8    Btisan      Betty

### Step 6. Print data3

In [20]:
data3

  subject_id  test_id
0          1       51
1          2       15
2          3       15
3          4       61
4          5       16
5          7       14
6          8       15
7          9        1
8         10       61
9         11       16

### Step 7. Merge all_data and data3 along the subject_id value

In [23]:
df_merge = pd.merge(all_data, data3, on='subject_id')
df_merge.head(10)

  subject_id last_name first_name  test_id
0          1  Anderson       Alex       51
1          2  Ackerman        Amy       15
2          3       Ali      Allen       15
3          4      Aoni      Alice       61
4          4    Bonder      Billy       61
5          5   Atiches     Ayoung       16
6          5     Black      Brian       16
7          7     Brice      Bryce       14
8          8    Btisan      Betty       15

### Step 8. Merge only the data that has the same 'subject_id' on both data1 and data2

In [24]:
pd.merge(data1,data2, how='inner', on='subject_id')

  subject_id last_name_x first_name_x last_name_y first_name_y
0          4        Aoni        Alice      Bonder        Billy
1          5     Atiches       Ayoung       Black        Brian

### Step 9. Merge all values in data1 and data2, with matching records from both sides where available.

In [25]:
pd.merge(data1,data2, on='subject_id', how='outer')

  subject_id last_name_x first_name_x last_name_y first_name_y
0          1    Anderson         Alex         NaN          NaN
1          2    Ackerman          Amy         NaN          NaN
2          3         Ali        Allen         NaN          NaN
3          4        Aoni        Alice      Bonder        Billy
4          5     Atiches       Ayoung       Black        Brian
5          6         NaN          NaN     Balwner         Bran
6          7         NaN          NaN       Brice        Bryce
7          8         NaN          NaN      Btisan        Betty